Ran Plan for project: `prod` dir: `opentofu` workspace: `prod`

<details><summary>Show Output</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place

OpenTofu will perform the following actions:

  # module.cloudflare-dns.cloudflare_dns_record.dns_record will be updated in-place
~ resource "cloudflare_dns_record" "dns_record" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-05-23T19:10:42Z" -> (known after apply)
        id                  = "228371bde09ff7188598f4df8a3b835c"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-05-25T12:59:03Z" -> (known after apply)
      ~ name                = "postgres.opentoucan.com" -> "postgres"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
      ~ tags                = [] -> (known after apply)
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.hetzner-vps.hcloud_firewall.firewall will be updated in-place
~ resource "hcloud_firewall" "firewall" {
        id     = "2127713"
        name   = "firewall"
        # (1 unchanged attribute hidden)

      - rule {
          - destination_ips = [] -> null
          - direction       = "in" -> null
          - protocol        = "icmp" -> null
          - source_ips      = [
              - "0.0.0.0/0",
              - "::/0",
            ] -> null
        }
      - rule {
          - destination_ips = [] -> null
          - direction       = "in" -> null
          - port            = "22" -> null
          - protocol        = "tcp" -> null
          - source_ips      = [
              - "0.0.0.0/0",
              - "::/0",
            ] -> null
        }
      - rule {
          - destination_ips = [] -> null
          - direction       = "in" -> null
          - port            = "5432" -> null
          - protocol        = "tcp" -> null
          - source_ips      = [
              - "0.0.0.0/0",
              - "::/0",
            ] -> null
        }
      + rule {
          + destination_ips = []
          + direction       = "in"
          + port            = "5432"
          + protocol        = "tcp"
          + source_ips      = [
              + "82.47.5.131/32",
            ]
        }
      + rule {
          + destination_ips = []
          + direction       = "in"
          + port            = "22"
          + protocol        = "tcp"
          + source_ips      = [
              + "0.0.0.0/0",
              + "::/0",
            ]
        }
      + rule {
          + destination_ips = []
          + direction       = "in"
          + port            = "5432"
          + protocol        = "tcp"
          + source_ips      = [
              + "0.0.0.0/0",
              + "::/0",
            ]
        }
      + rule {
          + destination_ips = []
          + direction       = "in"
          + protocol        = "icmp"
          + source_ips      = [
              + "0.0.0.0/0",
              + "::/0",
            ]
        }

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis-0:4141/lock?id=opentoucan%252Finfrastructure-config%252Fopentofu%252Fprod)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p prod
  ```
Plan: 0 to add, 2 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```